1.层次化索引了解的很少，以前接触的都是二维的数据列表

In [4]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [5]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [6]:
frame['Colorado']

     Green
a 1      2
  2      5
b 1      8
  2     11

In [9]:
frame.loc[['Colorado','a']]

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5

In [10]:
frame.unstack()  #变成只有一个行索引

   Ohio            Colorado
  Green    Red        Green
      1  2   1   2        1   2
a     0  3   1   4        2   5
b     6  9   7  10        8  11

2.df.swaplevel(0,1)交换索引的位置，但不改变数据，df.sort_index(level=)根据指定索引排序，重0层开始算

In [12]:
frame.swaplevel(1,0)

     Ohio     Colorado
    Green Red    Green
1 a     0   1        2
2 a     3   4        5
1 b     6   7        8
2 b     9  10       11

In [14]:
frame.sort_index(level=1)   #这里都是在原始数据上做的

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
b 1     6   7        8
a 2     3   4        5
b 2     9  10       11

3.df.set_index(drop=是否保留数据)指定某一列数据作为索引，df.reset_index()索引重回数据

4.合并数据的merge，可以传入参数how="outer"使用两个列表的所有键

感觉df.combine_first()非常好用，就像打补丁一样

In [15]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [16]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [17]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [18]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

5.还有一些合并数据，根据两个表不同的索引，可以很灵活的合并，但是看了很迷糊